In [ ]:
#pip install mljar-supervised
#https://supervised.mljar.com/

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report, accuracy_score, confusion_matrix, precision_score, recall_score
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score
from sklearn.preprocessing import MinMaxScaler
from imblearn.over_sampling import SMOTE
from supervised.automl import AutoML

In [3]:
#Load the dataset 
df = pd.read_csv('malwathu_0.csv')

In [4]:
# Dropping the null values.
df.dropna(inplace = True)

In [5]:
#Get the total number of rows and columns (shape)
df.shape

(4764, 7)

In [8]:
#x = df.drop(['col1','col2','col3'], axis=1)
#Not going to drop any input at 1st notebook

#dropping output
x = df.drop(['Kappachichiya'], axis=1)

In [9]:
x.shape

(4764, 6)

In [10]:
#correlation
x.corr()

,Murrunkan,Pavattakulam,Nachchiduva,Vavniya,Mannr,Apura
Murrunkan,1.000000,0.381640,0.293259,0.418335,0.540338,0.396421
Pavattakulam,0.381640,1.000000,0.311066,0.639919,0.362455,0.428007
Nachchiduva,0.293259,0.311066,1.000000,0.346511,0.251897,0.554785
Vavniya,0.418335,0.639919,0.346511,1.000000,0.414992,0.461856
Mannr,0.540338,0.362455,0.251897,0.414992,1.000000,0.362199
Apura,0.396421,0.428007,0.554785,0.461856,0.362199,1.000000

In [11]:
#head
x.head()

   Murrunkan  Pavattakulam  Nachchiduva  Vavniya  Mannr  Apura
0        0.0           0.0          0.0      0.0    0.0    0.0
1        0.0           0.0          0.0      0.0    0.0    0.0
2        0.0           0.0          0.0      0.0    0.0    0.0
3        0.0           0.0          0.0      0.0    0.0    0.0
4        0.0           0.0          0.0      0.0    0.0    0.0

In [12]:
#tail
x.tail()

      Murrunkan  Pavattakulam  Nachchiduva  Vavniya  Mannr  Apura
4759        0.0          58.0         62.0     59.3    0.0   15.6
4760       13.5           8.0         37.5     28.3    0.0   28.2
4761        9.7           0.0         10.5      0.0   17.8   20.8
4762        8.7           0.0          2.2      6.9    0.0    4.8
4763        0.0           0.9         12.5      1.0    3.2    4.2

In [13]:
#dropping inputs
y = df["Kappachichiya"]

In [14]:
#head
y.head()

0    0.0386
1    0.0277
2    0.0220
3    0.0208
4    0.0192
Name: Kappachichiya, dtype: float64

In [15]:
#tail
y.tail()

4759    0.0053
4760    0.0067
4761    0.1122
4762    0.1754
4763    0.1171
Name: Kappachichiya, dtype: float64